{"modelTopology":{"shape_name":"ring","iter_count":2399,"config":{"selectedNoiseType":"2D Gaussian","noiseSize":2,"numGeneratorLayers":1,"numDiscriminatorLayers":2,"numGeneratorNeurons":10,"numDiscriminatorNeurons":9,"dLearningRate":0.1,"gLearningRate":0.03,"gOptimizerType":"Adam","distanceType":"Barrier","kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_ring.weights.bin"],"weights":[{"name":"g-0","shape":[2,10],"dtype":"float32"},{"name":"g-1","shape":[10],"dtype":"float32"},{"name":"g-2","shape":[10,10],"dtype":"float32"},{"name":"g-3","shape":[10],"dtype":"float32"},{"name":"g-4","shape":[10,2],"dtype":"float32"},{"name":"g-5","shape":[2],"dtype":"float32"}]}]}