{"modelTopology":{"shape_name":"disjoint","iter_count":2275,"config":{"selectedNoiseType":"2D Gaussian","noiseSize":2,"numGeneratorLayers":1,"numDiscriminatorLayers":1,"numGeneratorNeurons":8,"numDiscriminatorNeurons":8,"dLearningRate":0.1,"gLearningRate":0.03,"gOptimizerType":"Adam","distanceType":"Barrier","kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_disjoint.weights.bin"],"weights":[{"name":"g-0","shape":[2,8],"dtype":"float32"},{"name":"g-1","shape":[8],"dtype":"float32"},{"name":"g-2","shape":[8,8],"dtype":"float32"},{"name":"g-3","shape":[8],"dtype":"float32"},{"name":"g-4","shape":[8,2],"dtype":"float32"},{"name":"g-5","shape":[2],"dtype":"float32"}]}]}