{"modelTopology":{"shape_name":"disjoint","iter_count":1525,"config":{"selectedNoiseType":"2D Gaussian","noiseSize":2,"numGeneratorLayers":2,"numDiscriminatorLayers":2,"numGeneratorNeurons":10,"numDiscriminatorNeurons":11,"dLearningRate":0.1,"gLearningRate":0.03,"dOptimizerType":"SGD","gOptimizerType":"SGD","distanceType":"L2","kDSteps":1,"kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_gaussians.weights.bin"],"weights":[{"name":"g-0","shape":[2,10],"dtype":"float32"},{"name":"g-1","shape":[10],"dtype":"float32"},{"name":"g-2","shape":[10,10],"dtype":"float32"},{"name":"g-3","shape":[10],"dtype":"float32"},{"name":"g-4","shape":[10,10],"dtype":"float32"},{"name":"g-5","shape":[10],"dtype":"float32"},{"name":"g-6","shape":[10,2],"dtype":"float32"},{"name":"g-7","shape":[2],"dtype":"float32"}]}]}