{"modelTopology":{"shape_name":"line","iter_count":2669,"config":{"selectedNoiseType":"1D Gaussian","noiseSize":1,"numGeneratorLayers":1,"numDiscriminatorLayers":1,"numGeneratorNeurons":5,"numDiscriminatorNeurons":6,"dLearningRate":0.03,"gLearningRate":0.03,"dOptimizerType":"SGD","gOptimizerType":"SGD","distanceType":"L2","kDSteps":2,"kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_line.weights.bin"],"weights":[{"name":"g-0","shape":[1,5],"dtype":"float32"},{"name":"g-1","shape":[5],"dtype":"float32"},{"name":"g-2","shape":[5,5],"dtype":"float32"},{"name":"g-3","shape":[5],"dtype":"float32"},{"name":"g-4","shape":[5,2],"dtype":"float32"},{"name":"g-5","shape":[2],"dtype":"float32"}]}]}